app/controllers/histories_controller.rb

SELECT "histories".* FROM "histories"
---
  def index
    @histories = History.all

INSERT INTO "histories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @history = History.new(history_params)
    @history.user = helpers.current_user if helpers.logged?

    respond_to do |format|
      if @history.save

SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_history
      @history = History.find(params[:id])