app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sebastian "], ["email", "sbstn.jmnz@yahoo.com"], ["password", "123456"], ["created_at", "2019-07-31 01:49:59.577088"], ["updated_at", "2019-07-31 01:49:59.577088"]]
---
  def create
    @user = User.new(user_params)
    if @user.save